Repository: wilzwert/myjobs
Catalog: frontend/src/i18n/messages.*.xlf
Languages: fr

# error.validation_failed
source: Validation error
fr: Erreur de validation

# error.field_cannot_be_empty
source: Field cannot be empty
fr: Le champ ne doit pas être vide

# error.invalid_value
source: Invalid value
fr: Valeur invalide

# error.invalid_email
source: Invalid email
fr: Email invalide

# error.invalid_url
source: Invalid url
fr: URL invalide

# error.field_too_short
source: Field too short
fr: Valeur trop courte

# error.field_too_long
source: Field too long
fr: Valeur trop longue

# error.field_min_max_length
source: Invalid field size
fr: Longueur incorrecte

# error.pagination_invalid_page
source: Invalid page
fr: Page invalide

# error.pagination_invalid_page_size
source: Invalid page size
fr: Taille de page invalide

# error.pagination_offset_too_big
source: Pagination offset too big
fr: Position invalide

# error.no_html_fetcher_found
source: HTML could not be fetched
fr: Impossible de récupérer le HTML

# error.no_metadata_extractor_found
source: Job metadata could not be extracted
fr: Impossible d'extraire les données du Job

# error.user_weak_password
source: Password does not meet requirements
fr: Le mot de passe est trop faible

# error.user_already_exists
source: User already exists
fr: L'utilisateur existe déjà

# error.user_not_found
source: User not found
fr: Utilisateur non trouvé

# error.user_login_failed
source: Login failed
fr: Connexion échouée

# error.user_password_match_failed
source: Invalid old password
fr: L'ancien mot de passe est incorrect

# error.user_password_reset_expired
source: Reset password token expired
fr: Le jeton de réinitialisation du mot de passe a expiré

# error.attachment_not_found
source: Attachment not found
fr: Pièce jointe non trouvée

# error.attachment_file_not_readable
source: Attachment file not readable
fr: Fichier non lisible

# error.job_already_exists
source: Job already exists
fr: Le job existe déjà

# error.job_not_found
source: Job not found
fr: Job non trouvé

# error.unknown
source: An unknown error occurred code
fr: Une erreur inconnue est survenuecode

# info.registered
source: Registered
fr: Inscrit

# info.invalid
source: Invalid
fr: Invalide

# action.validate
source: Validate
fr: Valider

# info.valid
source: Valid
fr: Valide

# info.verified
source: Verified
fr: Vérifié

# action.edit
source: Edit
fr: Modifier

# action.change_password
source: Change password
fr: Modifier mon mot de passe

# menu.logout.label
source: Log out
fr: Déconnexion

# action.user.delete_account
source: Delete my account
fr: Supprimer mon compte

# input.email.placeholder
source: Enter your email
fr: Saisissez votre email

# input.username.label
source: Username
fr: Nom d'utilisateur

# input.username.placeholder
source: Type your username
fr: Saisissez votre nom d'utilisateur

# input.first_name.label
source: First name
fr: Prénom

# input.first_name.placeholder
source: Enter your first name
fr: Saisissez votre prénom

# input.last_name.label
source: Last name
fr: Nom

# input.last_name.placeholder
source: Enter your last name
fr: Saisissez votre nom

# user.information.edit
source: Edit my information
fr: Modifier mes informations

# info.email_exists
source: Email already exists
fr: Cet email est déjà utilisé

# info.username_exists
source: Username already taken
fr: Ce nom d'utilisateur est déjà utilisé

# info.loading
source: Loading...
fr: Chargement...

# action.save
source: Save
fr: Enregistrer

# user.password.change
source: Change my password
fr: Modifier mon mot de passe

# input.old_password.label
source: Current password
fr: Mot de passe actuel

# input.old_password.placeholder
source: Enter your current password
fr: Saisissez votre mot de passe actuel

# input.new_password.label
source: New password
fr: Nouveau mot de passe

# input.new_password.placeholder
source: Enter your new password
fr: Saisissez votre nouveau mot de passe

# input.new_password_confirmation.label
source: New password confirmation
fr: Confirmation du mot de passe

# input.new_password_confirmation.placeholder
source: Confirm your new password
fr: Confirmez votre mot de passe

# info.confirmation_required
source: Confirmation required
fr: Confirmation requise

# action.cancel
source: Cancel
fr: Annuler

# action.confirm
source: Confirm
fr: Confirmer

# action.user.send_validation_email
source: Send validation email
fr: Envoyer l'email de vérification

# error.unexpected_error
source: An unexpected error occurred
fr: Une erreur inattendue est survenue

# info.account_deleted
source: Your account has been deleted. Thank your for using MyJobs.
fr: Votre compte a été supprimé. Merci d'avoir utilisé MyJobs.

# warning.user.account_delete
source: Delete your accout ? All data will be definitely deleted !
fr: Supprimer votre compte ? Toutes vos données seront définitivement supprimées !

# info.user.validation_email_sent
source: The verification email has been sent ; please check your emails.
fr: L'email de vérification a été envoyé ; merci de vérifier vos emails.

# job.status.created
source: Created
fr: Créé

# job.status.pending
source: Pending
fr: En attente (postulé)

# job.status.relaunched
source: Relaunched
fr: Relancé

# job.status.applicant_refused
source: Refused (by me)
fr: Refusé (par moi)

# job.status.company_refused
source: Refused (by company)
fr: Refusé (par l'entreprise)

# input.job.url_create.label
source: Create job with its url
fr: Créer un job à partir de son URL

# input.job.url_create.placeholder
source: Type or paste the job's URL
fr: Saisissez ou collez l'URL du job

# input.jobs.sort.option.date_desc
source: Date (newest first)
fr: Date (plus récentes)

# input.jobs.sort.option.date_asc
source: Date (oldest first)
fr: Date (plus anciennes)

# input.jobs.sort.option.rating_desc
source: Rating (highest first)
fr: Note (décroissante)

# input.jobs.sort.option.rating_asc
source: Rating (lowest first)
fr: Note (croissante)

source: Job details
fr: Détails

# job.created
source: Job creation date
fr: Créé

# job.activities.count
source: Activities count
fr: Activités

# job.attachments.count
source: Attachments count
fr: Pièces jointes

# action.job.edit
source: Edit
fr: Modifier

# action.job.attachements
source: Attachments
fr: Pièces jointes

# action.job.delete
source: Delete
fr: Supprimer

# pagination.first_page_label
source: First page
fr: Première page

# pagination.items_per_page_label
source: Items per page
fr: Résultats par page

# pagination.last_page_label
source: Last page
fr: Dernière page

# pagination.next_page_label
source: Next page
fr: Page suivante

# pagination.previous_page_label
source: Previous page
fr: Page précédente

# pagination_page_one_of_one
source: Page 1 of 1
fr: Page 1 sur 1

# pagination_range_label
source: Page page + 1 of amountPages
fr: Page page + 1 sur amountPages

# pagination.jobs.select_page_label
source: Select list page
fr: Aller à la page

# action.job.quick_create
source: Create
fr: Créer

# action.job.add_activity
source: Add activity
fr: Ajouter une activité

# job.activity.creation
source: Creation
fr: Création

# job.activity.applicant_refusal
source: Refusal (by me)
fr: Refus (par moi)

# job.activity.attachment_creation
source: Attachement creation
fr: Création de pièce jointe

# job.activity.attachment_deletion
source: Attachement deletion
fr: Suppression de pièce jointe

# job.activity.application
source: Application
fr: Candidature

# job.activity.relaunch
source: Relaunch
fr: Relance

# job.activity.company_refusal
source: Refusal (by company)
fr: Refus (par l'entreprise)

# job.activity.in_person_interview
source: In person interview
fr: Entretien en présentiel

# job.activity.video_interview
source: Video interview
fr: Entretien visio

# job.activity.phone_interview
source: Phone interview
fr: Entretien téléphonique

# job.activity.rating
source: Rating
fr: Note

# job.edit
source: Edit job
fr: Modifier le job

# job.create
source: Create a job
fr: Créer un job

# input.url.placeholder
source: Job url
fr: URL du job

# input.job.title.label
source: Title
fr: Titre

# input.job.title.placeholder
source: Job title
fr: Saisissez l'intitulé du poste

# input.job.company.label
source: Company
fr: Entreprise

# input.job.company.placeholder
source: Company
fr: Saisissez le nom de l'entreprise

# input.job.description.placeholder
source: Job description
fr: Description du poste

# input.job.profile.label
source: Profile
fr: Profil

# input.job.salary.label
source: Salary
fr: Salaire

# input.job.salary.placeholder
source: Salary
fr: Salaire du poste

# error.label
source: An error occurred
fr: Une erreur est survenue

# action.create
source: Create
fr: Créer

# job.created_or_saved
source: Job term successfully
fr: Le job a bien été term

# info.job.updated
source: updated
fr: enregistré

# error.job.create_or_save
source: Job could not be term.error.message
fr: Le job n'a pas pu être term.error.message

# job.stepper.create.label
source: Job creation
fr: Création du job

# job.stepper.attachments.label
source: Attachments
fr: Pièces jointes

# job.stepper.action.skip
source: Skip
fr: Passer

# job.stepper.activities.label
source: Activities
fr: Activités

# stepper.optional.label
source: Optional
fr: Optionnel

# job.deleted
source: Job successfully deleted.
fr: Job supprimé.

# warning.job.delete
source: Delete job "job.title" ? All data will be lost.
fr: Supprimer "job.title" ? Toutes les données seront perdues.

# info.job.rating.updated
source: Rating updated successfully.
fr: La note a bien été modifiée.

# info.job.created
source: created
fr: créé

# action.job.attachement.download
source: Download
fr: Télécharger

# action.job.attachement.delete
source: Delete
fr: Supprimer

# action.job.attachement.add
source: Add attachment
fr: Ajouter une pièce jointe

# job.attachments.manage
source: Manage attachements
fr: Gérer les pièces jointes

# job.attachments.add
source: Add attachments
fr: Ajouter des pièces jointes

# job.activities.manage
source: Manage activities
fr: Gérer les activités

# job.activities.add
source: Add activities
fr: Ajouter des activités

# input.attachment.name.label
source: Name
fr: Nom

# input.attachment.file.label
source: File
fr: Fichier

# action.attachment.remove
source: Remove this attachment
fr: Retirer cette pièce jointe

# attachment.form.add
source: Add an attachment
fr: Ajouter une pièce jointe

# input.attachment.name.placeholder
source: Attachment name
fr: Nom de la pièce jointe

# error.password.too_short
source: too short (min 8 characters)
fr: trop court (min 8 caractères)

# error.password.too_long
source: too long (max 128 characters)
fr: trop long (max 16 caractères)

# error.password.uppercase
source: needs at least 1 uppercase character
fr: au moins 1 majuscule

# error.password.lowercase
source: needs at least 1 lowercase character
fr: au moins 1 minuscule

# error.password.digit
source: needs at least 1 digit
fr: au moins 1 chiffre

# error.password.symbol
source: needs at least 1 symbol (!@#$%^&*(),.?":{}|<>)
fr: au moins 1 caractère spécial (!@#$%^&*(),.?":{}|<>)

# user.password.new
source: Create a new password
fr: Créer un nouveau mot de passe

# action.password.reset
source: Reset your password
fr: Réinitialiser

# user.password.reset.title
source: Reset your password
fr: Réinitialiser votre mot de passe

# action.register
source: Register
fr: Inscription

# user.registration.title
source: Registration
fr: Inscription

# action.password.forgotten
source: Forgot password ?
fr: Mot de passe oublié ?

# input.password.label
source: Password
fr: Mot de passe

# input.password.placeholder
source: Enter your password
fr: Saisissez votre mot de passe

# message.disconnected
source: You have been disconnected.
fr: Vous avez été déconnecté.

# message.registration.success
source: Registration completed successfully, you may now log in.
fr: Votre compte a bien été créé, vous pouvez maintenant vous connecter.

# action.close
source: Close
fr: Fermer

# error.login
source: Login failed
fr: La connexion a échoué

# info.login.verify
source: Please verify your email or password
fr: Merci de vérifier votre email et votre mot de passe

# error.field_value_too_small
source: Value must be at least {{min}}
fr: La valeur doit être d'au moins {{min}}

# input.jobFollowUpReminderDays.label
source: Job reminder delay (days)
fr: Délai de rappel sur les Jobs en attente (en jours)

# input.jobFollowUpReminderDays.placeholder
source: Job reminder delay (days)
fr: Me rappeler au bout de X jours

# error.field_value_too_big
source: Value must be at most {{max}}
fr: La valeur doit être inférieure ou égale à {{max}}

# error.password.creation
source: Password creation failed
fr: La création du mot de passe a échoué

# info.password.updated
source: Your password has been updated.
fr: Votre mot de passe a bien été mis à jour.

# info.login.possible
source: You may now log in.
fr: Vous pouvez maintenant vous connecter.

# info.user.edit.success
source: Your information has been updated.
fr: Vos informations ont bien été mises à jour.

# info.email.verification.needed
source: Your new email address needs verification ; please check your emails.
fr: Votre nouvelle adresse mail doit être vérifiée ; veuillez vérifier vos emails.

# job.status.accepted
source: Accepted
fr: Recruté

# action.activity.delete
source: Remove this activity
fr: Supprimer cette activité

# action.jobs.back
source: Go back to jobs
fr: Retour aux jobs

# job.description.label
source: Description
fr: Description du poste

# info.empty
source: Empty
fr: Non renseigné

# job.profile.label
source: Profile
fr: Profil recherché

# job.attachments.label
source: Attachments
fr: Pièces jointes

# job.activities.label
source: Activities
fr: Activités

# job.url_create.title
source: Create a Job with its URL
fr: Créer un Job à partir de son URL

# action.job.view.original
source: View original job
fr: Voir l'offre d'origine

# action.job.actions
source: Actions for this job
fr: Actions pour ce job

# info.email.validated
source: Your email has been validated.
fr: Votre adresse mail a été validée.

# error.password.confirmation.match
source: Password and confirmation don't match
fr: Le mot de passe et sa confirmation ne correspondent pas

# info.password.reset.processed
source: Your request has been processed. If your email is linked to an account, an email has been sent. Please check your emails for further instructions.
fr: Votre demande a été traitée. Si votre adresse mail est liée à un compte, un email a été envoyé. Veuillez vérifier vos mails.

# home.text.about.title
source: About
fr: A propos

# home.text.about.introduction
source: This is a personal project with several goals :
fr: MyJobs est un projet personnel qui a plusieurs objectifs :

# home.text.about.manage
source: Help me manage my job search by keeping track of jobs statuses and applications (spoiler alert : there's a good chance this project will never do what I originally intended)
fr: M'aider à gérer ma recherche d'emploi en ayant un suivi du statut des jobs et de mes candidatures (spoiler alert : il y a de bonnes chances que ce projet ne fasse jamais ce que j'avais en tête à l'origine)

# home.text.about.learn
source: Learn as much and as fast as possible about Spring Boot, Hexagonal Architecture, Clean Architecture, MongoDB and Domain-Driven Design (DDD), and lots of other things I will forget (or not)
fr: Apprendre autant que possible et aussi rapidement que possible sur Spring Boot, Hexagonal Architecture, Clean Architecture, MongoDB et le Domain-Driven Design (DDD), et beaucoup d'autres choses que j'oublierai (ou pas)

# home.text.about.disclaimer
source: It is usable, although not to be trusted as a long-term tool. I will take any feedback though, and be glad should anyone find it useful.
fr: Il est utilisable en l'état, mais sans doute pas sur long terme. Je suis toutefois preneur de toute remarque ou suggestion, et je serai ravi si jamais quelqu'un trouve cet outil utile.

source: Please feel free to contact me on
fr: N'hésitez pas à me contacter sur

# home.text.features.title
source: Features
fr: Fonctionnalités

# home.text.features.introduction
source: MyJobs allows you to :
fr: MyJobs vous permet de :

# home.text.features.save
source: Save interesting job offers
fr: Sauvegarder des offres de jobs

# home.text.features.attachments
source: Add attachments, so that you can remember which CV or documents you sent to the recruiter
fr: Ajouter des pièces jointes, pour conserver une trace des CV et documents envoyés au recruteur

# home.text.features.status
source: Manage jobs status : created, pending (i.e. an application has been sent), refused, accepted...
fr: Gérer le statut des jobs : crée, en attente(une candidature a été envoyée), refusé, recruté...

# home.text.features.activities
source: Add activities : keep track of actions you made
fr: Ajouter des activités : conserver une trace des actions effectuées

# home.text.features.reminders
source: Receive reminders : define a delay to be reminded of jobs that have not been updated
fr: Recevoir des rappels : définir un délai au delà du vous souhaitez recevoir un rappel des jobs en cours non mis à jour

# home.text.features.rate
source: Rate jobs : this can be used as a way to rate your interest for the job, the quality of the recruitment process. This is up to you !
fr: Noter les jobs : cela peut être utilisé pour noter votre niveau d'intérêt pour un job, la qualité du process de recrutement, etc. A vous de voir !

# menu.account.label
source: Account
fr: Compte

# menu.log_out.label
source: Logout
fr: Déconnexion

# error.email.validation_failed
source: Email validation failed
fr: La validation de votre adresse mail a échoué

# message.attachement.created
source: Attachment created successfully
fr: La pièce jointe a été créé

# error.file.download
source: File download failed
fr: Le téléchargement a échoué

# action.filter.status
source: Status
fr: Statut

# action.sort
source: Sort
fr: Trier

# message.activities.created
source: activities.length activities created successfully
fr: activities.length activités ont été créées

# message.activity.created
source: Activity created successfully
fr: Activité créée

# message.attachements.created
source: attachments.length attachments created successfully
fr: attachments.length pièces jointes ont été créées

# info.attachment.delete.confirmation_required
source: Delete attachment "attachment.name" ?
fr: Supprimer la pièce jointe "attachment.name" ?

# error.activities.creation
source: Activities could not be created.
fr: Les activités n'ont pas pu être créées.

# message.attachment.deleted
source: Attachment deleted successfully
fr: La pièce jointe a été supprimée

# job.status.expired
source: Expired
fr: Expiré

# job.status.cancelled
source: Cancelled
fr: Annulé

# job.status.hired
source: Hired
fr: Recruté

# job.status.filter.active
source: Active
fr: Actif

# job.status.filter.inactive
source: Inactive
fr: Inactif

# job.status.filter.late
source: Late
fr: En retard

# input.job.comment.label
source: Comment
fr: Commentaire

# input.job.comment.placeholder
source: Job comment
fr: Commentaire sur le job

# job.comment
source: Comment
fr: Commentaire

# action.job.comment.edit
source: Edit comment
fr: Modifier le commentaire

# alert.file_too_big
source: File too big
fr: Fichier trop volumineux

# input.job.profile.placeholder
source: Job profile
fr: Profil

# job.status
source: Current status
fr: Statut actuel

# job.status.date
source: Current status date
fr: Date du statut actuel

# job.late
source: This job has not been updated recently
fr: Ce job n'a pas été mis à jour récemment

# input.activity.comment.label
source: Comment
fr: Commentaire

# input.activity.comment.placeholder
source: Activity comment
fr: Commentaire de l'activité

# action.activities.save
source: Save activities
fr: Enregistrer les activités

# form.activities.add
source: Add an activity
fr: Ajouter une activité

# job.activity.job_expiration
source: Job expired
fr: Job expiré

# job.activity.job_cancellation
source: Job cancelled
fr: Recrutement annulé

# job.activity.acceptance
source: Job accepted
fr: Poste accepté

# job.activity.hiring
source: Hired
fr: Recruté

# action.job.activities
source: Activities
fr: Activités

# input.job.query.placeholder
source: Search (full words only)
fr: Mot(s)-clé (mots entiers uniquement)
